Herin-iaina/esp32-fastapi/routers/main.cpp
// ============================================================
//  OBJETS GLOBAUX
// ============================================================
DHT dht_1(DHT_1_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_2(DHT_2_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_3(DHT_3_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_4(DHT_4_PIN_DATA, DHT_SENSOR_TYPE);

AccelStepper stepper(AccelStepper::DRIVER, STEPPER_PIN_STEP, STEPPER_PIN_DIR);
LiquidCrystal_I2C lcd(LCD_ADDRESS, LCD_COLS, LCD_ROWS);

// ============================================================
//  STRUCTURES DE DONNÉES & VARIABLES GLOBALES
// ============================================================
struct SensorData {
  float temperature = 0.0f;
  float humidity    = 0.0f;
  bool  valid       = false;
};

struct SharedState {
  // Écrit par core 1, lu par core 0
  bool     sensorDataReady = false;
  String   pendingPayload;

  // Écrit par core 0, lu par core 1
  bool wifiConnected     = false;
  bool serverConnected   = false;
  bool autonomousMode    = false;
  int  serverFailCount   = 0;

  bool fanCmdFromServer      = false;
  bool humidCmdFromServer    = false;
  bool automationCmdPending  = false;

  bool stepperRequestPending = false;
};

SharedState shared;
SemaphoreHandle_t stateMutex;
SemaphoreHandle_t lcdLogMutex;
TaskHandle_t networkTaskHandle;

bool  fanOn           = false;
bool  humidifierOn    = false;
bool  autonomousMode  = false;   // Copie locale Core 1
bool  serverConnected = false;   // Copie locale Core 1
bool  wifiConnected   = false;   // Copie locale Core 1

float avgTemperature  = 0.0f;
float avgHumidity     = 0.0f;
int   numFailedSensors = 0;
bool  stepperEnabled   = false;

// Anti-rebond non-bloquant
unsigned long lastButtonPress       = 0;
unsigned long lastScrollButtonPress = 0;
bool stepperBtnPendingCheck         = false;
bool lcdBtnPendingCheck             = false;
unsigned long stepperBtnTriggerTime = 0;
unsigned long lcdBtnTriggerTime     = 0;

// LCD log ring buffer
char lcdLogBuffer[LCD_LOG_BUFFER_SIZE][LCD_COLS + 1];
int  lcdLogCount = 0;
int  lcdLogIndex = 0;
int  lcdLogStart = 0;
unsigned long lastLogScroll = 0;

// ============================================================
//  GESTION STEPPER / POWER (Core 1)
// ============================================================

void enableStepper() {
  if (!stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_STATE);
    delay(20); // Stabilisation du courant avant le premier pas (aligné sur le test validé)
    stepperEnabled = true;
  }
}

void disableStepper() {
  if (stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_DISABLE_STATE);
    stepperEnabled = false;
  }
}

void startStepperRotation(const char* origin) {
  if (stepper.distanceToGo() != 0) {
    Serial.printf("Rotation ignoree (%s) — moteur deja en mouvement\n", origin);
    return;
  }
  Serial.printf("Rotation stepper activee (%s)\n", origin);
  stepper.setMaxSpeed(STEPPER_SPEED);
  enableStepper();
  stepper.move(STEPPER_ROTATION_STEPS);
}

// ============================================================
//  UTILITAIRES LCD LOG & DISPLAY (Core 1)
// ============================================================

void printLCDLine(int row, const char* line) {
  lcd.setCursor(0, row);
  lcd.print(line);
  for (int i = strlen(line); i < LCD_COLS; i++) {
    lcd.print(' ');
  }
}

void pushLCDLog(const char* msg) {
  char text[LCD_COLS + 1];
  snprintf(text, sizeof(text), "%s", msg);

  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);

  int lastIndex = (lcdLogStart + lcdLogCount - 1 + LCD_LOG_BUFFER_SIZE) % LCD_LOG_BUFFER_SIZE;
  if (lcdLogCount > 0 && strcmp(text, lcdLogBuffer[lastIndex]) == 0) {
    xSemaphoreGive(lcdLogMutex);
    return;
  }

  if (lcdLogCount < LCD_LOG_BUFFER_SIZE) {
    int idx = (lcdLogStart + lcdLogCount) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
    lcdLogCount++;
  } else {
    lcdLogStart = (lcdLogStart + 1) % LCD_LOG_BUFFER_SIZE;
    int idx = (lcdLogStart + lcdLogCount - 1) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
  }

  xSemaphoreGive(lcdLogMutex);
}

void getCurrentLCDLog(char* out, size_t outSize) {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount == 0) {
    out[0] = '\0';
  } else {
    if (lcdLogIndex >= lcdLogCount) {
      lcdLogIndex = 0;
    }
    int idx = (lcdLogStart + lcdLogIndex) % LCD_LOG_BUFFER_SIZE;
    snprintf(out, outSize, "%s", lcdLogBuffer[idx]);
  }
  xSemaphoreGive(lcdLogMutex);
}

void advanceLCDLog() {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount > 1) {
    lcdLogIndex = (lcdLogIndex + 1) % lcdLogCount;
  }
  xSemaphoreGive(lcdLogMutex);
}

void updateLCDScroll(unsigned long now) {
  if (now - lastLogScroll >= LCD_SCROLL_INTERVAL) {
    lastLogScroll = now;
    advanceLCDLog();
  }
}

void displayStatusOnLCD(float avgTemp, float avgHumid) {
  char line0[LCD_COLS + 1];
  bool stepperMoving = stepper.distanceToGo() != 0;
  const char* wifiState = wifiConnected ? "OK" : "--";

  if (autonomousMode) {
    snprintf(line0, sizeof(line0), "AUTO W:%s S:%s", wifiState, stepperMoving ? "ON" : "OFF");
  } else {
    snprintf(line0, sizeof(line0), "T:%.0f H:%d W:%s", avgTemp, (int)avgHumid, wifiState);
  }
  printLCDLine(0, line0);

  char line1[LCD_COLS + 1];
  getCurrentLCDLog(line1, sizeof(line1));
  printLCDLine(1, line1);
}

// ============================================================
//  WIFI & SERVEUR (Core 0 - NetworkTask)
// ============================================================

void buildServerUrl(const char* endpoint, char* output, size_t size) {
  // Le backend FastAPI est exposé avec le préfixe /api
  snprintf(output, size, "http://%s:%d/api%s", serverIP, serverPort, endpoint);
}

void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  WiFi.mode(WIFI_STA);
  // Réduit la puissance d'émission WiFi pour limiter les pics de courant
  // (jusqu'à ~400-500mA en pleine puissance) qui peuvent faire chuter le
  // rail 3.3V sous le seuil du détecteur de brownout sur une alimentation
  // USB faible/longue. Ce n'est qu'une mitigation logicielle : le vrai fix
  // reste une alimentation capable de fournir les pics de courant (voir
  // note plus bas) + un condensateur de découplage proche de l'ESP32.
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  WiFi.setHostname(HOSTNAME);
  Serial.println(F("Connexion WiFi..."));
  WiFi.begin(ssid, password);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_TIMEOUT) {
    vTaskDelay(pdMS_TO_TICKS(500)); 
    // FIX 2 : Feed du WDT dans la boucle d'attente WiFi pour éviter le reset intempestif
    esp_task_wdt_reset(); 
    Serial.print(".");
  }

  bool isConnected = (WiFi.status() == WL_CONNECTED);
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  shared.wifiConnected = isConnected;
  xSemaphoreGive(stateMutex);

  if (isConnected) {
    Serial.println("\nConnecte — IP: " + WiFi.localIP().toString());
    pushLCDLog("WiFi connecte");
  } else {
    Serial.printf("\nEchec WiFi (statut=%d)\n", WiFi.status());
    pushLCDLog("WiFi echec");
  }
}

void checkAutonomousMode_locked() {
  if (!shared.autonomousMode && shared.serverFailCount >= MAX_SERVER_RETRIES) {
    shared.autonomousMode = true;
    Serial.println(F("\n*** MODE AUTONOME ACTIVE ***"));
    Serial.printf("  %d echecs consecutifs\n", MAX_SERVER_RETRIES);
    pushLCDLog("Mode autonome");
  }
}

bool sendDataToServer(const String& jsonPayload) {
  if (WiFi.status() != WL_CONNECTED) {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.wifiConnected = false;
    shared.serverFailCount++;
    checkAutonomousMode_locked();
    xSemaphoreGive(stateMutex);
    return false;
  }

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/values", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("x-api-key", apiKey);

