Herin-iaina/esp32-fastapi/routers/main.cpp
  if (!serverOk || autonomousMode) {
    digitalWrite(LED_BLUE_PIN, HIGH);
  }
  if (avgTemp <= 0.0f || avgHumid <= 0.0f) {
    digitalWrite(LED_RED_PIN, HIGH);
    return;
  }

  bool tempOk  = avgTemp  >= TEMP_MIN     && avgTemp  <= TEMP_MAX;
  bool humidOk = avgHumid >= HUMIDITY_MIN && avgHumid <= HUMIDITY_MAX;

  if (tempOk && humidOk) {
    digitalWrite(LED_GREEN_PIN, HIGH);
  } else if (avgTemp > TEMP_MAX || avgHumid > HUMIDITY_MAX) {
    digitalWrite(LED_RED_PIN, HIGH);
  } else {
    digitalWrite(LED_ORANGE_PIN, HIGH);
  }
}

// FIX 3 : Debounce 100% NON-BLOQUANT pour éliminer les micro-saccades moteur
void checkStepperButton() {
  const unsigned long DEBOUNCE = 200;
  const unsigned long CONFIRM_TIME = 20;
  unsigned long now = millis();

  if (!stepperBtnPendingCheck) {
    if (digitalRead(BUTTON_STEPPER_PIN) == LOW && (now - lastButtonPress > DEBOUNCE)) {
      stepperBtnPendingCheck = true;
      stepperBtnTriggerTime = now;
    }
  } else {
    if (now - stepperBtnTriggerTime >= CONFIRM_TIME) {
      stepperBtnPendingCheck = false;
      if (digitalRead(BUTTON_STEPPER_PIN) == LOW) {
        lastButtonPress = now;
        pushLCDLog("Stepper manuel");
        startStepperRotation("bouton");
      }
    }
  }
}

void checkLCDScrollButton() {
  const unsigned long DEBOUNCE = 200;
  const unsigned long CONFIRM_TIME = 20;
  unsigned long now = millis();

  if (!lcdBtnPendingCheck) {
    if (digitalRead(BUTTON_LCD_SCROLL_PIN) == LOW && (now - lastScrollButtonPress > DEBOUNCE)) {
      lcdBtnPendingCheck = true;
      lcdBtnTriggerTime = now;
    }
  } else {
    if (now - lcdBtnTriggerTime >= CONFIRM_TIME) {
      lcdBtnPendingCheck = false;
      if (digitalRead(BUTTON_LCD_SCROLL_PIN) == LOW) {
        lastScrollButtonPress = now;
        advanceLCDLog();
      }
    }
  }
}

void applyNetworkOutputs() {
  bool localAutonomous, localServerConnected, localWifiConnected;
  bool automationPending, fanCmd = false, humidCmd = false;
  bool stepperPending;

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  localAutonomous      = shared.autonomousMode;
  localServerConnected = shared.serverConnected;
  localWifiConnected   = shared.wifiConnected;
  automationPending    = shared.automationCmdPending;
  if (automationPending) {
    fanCmd   = shared.fanCmdFromServer;
    humidCmd = shared.humidCmdFromServer;
    shared.automationCmdPending = false;
  }
  stepperPending = shared.stepperRequestPending;
  if (stepperPending) {
    shared.stepperRequestPending = false;
  }
  xSemaphoreGive(stateMutex);

  autonomousMode  = localAutonomous;
  serverConnected = localServerConnected;
  wifiConnected   = localWifiConnected;

  if (!autonomousMode && automationPending) {
    digitalWrite(FAN_PIN,        fanCmd   ? HIGH : LOW);
    digitalWrite(HUMIDIFIER_PIN, humidCmd ? HIGH : LOW);
    fanOn        = fanCmd;
    humidifierOn = humidCmd;
  }

  if (stepperPending) {
    startStepperRotation("serveur");
  }
}

void printStatus(SensorData sensors[], int count, float avgTemp, float avgHumid, int failed) {
  Serial.println(F("\n========== STATUS =========="));
  for (int i = 0; i < count; i++) {
    Serial.printf("  Capteur %d: %.1f°C, %.1f%% %s\n",
                  i + 1, sensors[i].temperature, sensors[i].humidity,
                  sensors[i].valid ? "" : "[ERREUR]");
  }
  Serial.printf("  Moyenne   : %.2f°C, %.2f%%\n", avgTemp, avgHumid);
  Serial.printf("  Fan: %s  |  Humidif: %s  |  Defauts: %d\n",
                fanOn ? "ON" : "OFF", humidifierOn ? "ON" : "OFF", failed);
  Serial.printf("  Stepper: %s (%ld)\n",
                stepper.distanceToGo() != 0 ? "MOVING" : "IDLE", stepper.distanceToGo());
  Serial.printf("  Server: %s  WiFi: %s\n",
                serverConnected ? "OK" : "NOK", wifiConnected ? "OK" : "NOK");
  if (autonomousMode) {
    Serial.println(F("  >>> MODE AUTONOME ACTIF <<<"));
  }
  Serial.println(F("============================\n"));
}

void setup() {
#if DEBUG_DISABLE_BOD
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // ⚠️ diagnostic seulement, voir note plus haut
#endif

  Serial.begin(115200);
  delay(1000);

  Serial.println(F("\n=== ESP32 Incubator Controller v4.2 ==="));

  // Les mutex doivent être créés en tout premier : pushLCDLog() (appelée dès
  // le premier lcd.init()/printLCDLine ci-dessous) prend lcdLogMutex, et
  // sendDataToServer()/checkAutonomousMode_locked() prennent stateMutex. Tant
  // que ces handles valent NULL (valeur par défaut avant création), tout
  // xSemaphoreTake() dessus déclenche l'assertion FreeRTOS
  // "xQueueSemaphoreTake ... (( pxQueue ))" et fait rebooter la carte.
  stateMutex  = xSemaphoreCreateMutex();
  lcdLogMutex = xSemaphoreCreateMutex();

  // FIX 4 : Rétrocompatibilité multi-versions ESP32 Arduino Core (v2.x vs v3.x)
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = (1 << 0) | (1 << 1),
      .trigger_panic = true
  };
  esp_task_wdt_reconfigure(&twdt_config);
  esp_task_wdt_add(NULL);
#else
  esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
  esp_task_wdt_add(NULL);
#endif

  pinMode(STEPPER_ENABLE_PIN, OUTPUT);
  disableStepper();

  lcd.init();
  lcd.backlight();
  printLCDLine(0, "ESP32 Sensor v4");
  printLCDLine(1, "Init...");
  pushLCDLog("Initializing...");

#if !TEST_MODE_SKIP_SENSORS
  dht_1.begin();
  dht_2.begin();
  dht_3.begin();
  dht_4.begin();
#endif

  stepper.setMaxSpeed(STEPPER_MAX_SPEED);
  stepper.setAcceleration(STEPPER_ACCELERATION);

  pinMode(FAN_PIN,        OUTPUT);
  digitalWrite(FAN_PIN,        LOW);
  pinMode(HUMIDIFIER_PIN, OUTPUT);
  digitalWrite(HUMIDIFIER_PIN, LOW);

  initLEDs();
  digitalWrite(LED_BLUE_PIN, HIGH);

  pinMode(BUTTON_STEPPER_PIN,    INPUT_PULLUP);
  pinMode(BUTTON_LCD_SCROLL_PIN, INPUT_PULLUP);

  xTaskCreatePinnedToCore(
    networkTaskFunction,
    "NetworkTask",
    8192,
    NULL,
    1,
    &networkTaskHandle,
    0
  );

  Serial.println(F("Initialisation terminee. NetworkTask sur Core 0.\n"));
}

void loop() {
  esp_task_wdt_reset(); 

  static unsigned long lastSendTime     = 0;
  static unsigned long lastSlowTaskTime = 0;
  unsigned long now = millis();

