Herin-iaina/esp32-fastapi/routers/main.cpp
  applyNetworkOutputs();

  // Pilotage non-bloquant du Stepper
  if (stepper.distanceToGo() != 0) {
    enableStepper();
    stepper.run();
  } else {
    disableStepper();
  }

  // Lecture et traitement des capteurs
  if (now - lastSendTime >= SEND_INTERVAL) {
    lastSendTime = now;

#if TEST_MODE_SKIP_SENSORS
    // Pas de lecture DHT — juste un heartbeat pour confirmer que loop()
    // tourne normalement pendant le test du stepper.
    Serial.println(F("[TEST_MODE_SKIP_SENSORS] capteurs desactives — test stepper en cours"));
#else
    SensorData sensors[4];
    sensors[0] = readSensor(dht_1, 1);
    sensors[1] = readSensor(dht_2, 2);
    sensors[2] = readSensor(dht_3, 3);
    sensors[3] = readSensor(dht_4, 4);

    calculateAverages(sensors, 4, avgTemperature, avgHumidity, numFailedSensors);

    JsonDocument payload;
    for (int i = 0; i < 4; i++) {
      char key[10];
      snprintf(key, sizeof(key), "sensor_%d", i + 1);
      payload[key]["temperature"] = sensors[i].temperature;
      payload[key]["humidity"]    = sensors[i].humidity;
      payload[key]["valid"]       = sensors[i].valid;
    }
    payload["average_temperature"] = avgTemperature;
    payload["average_humidity"]    = avgHumidity;
    payload["fan_status"]          = fanOn;
    payload["humidifier_status"]   = humidifierOn;
    payload["numFailedSensors"]    = numFailedSensors;

    String jsonPayload;
    serializeJson(payload, jsonPayload);

    if (!autonomousMode) {
      xSemaphoreTake(stateMutex, portMAX_DELAY);
      shared.pendingPayload   = jsonPayload;
      shared.sensorDataReady  = true;
      xSemaphoreGive(stateMutex);
    }

    if (autonomousMode || !serverConnected) {
      applyBackupLogic(avgTemperature, avgHumidity);
    }

    printStatus(sensors, 4, avgTemperature, avgHumidity, numFailedSensors);
#endif
  }

  // Tâches secondaires d'affichage et boutons
  if (now - lastSlowTaskTime >= 50) {
    lastSlowTaskTime = now;
    checkStepperButton();
    checkLCDScrollButton();
    updateLCDScroll(now);
    updateStatusLEDs(avgTemperature, avgHumidity, serverConnected);
    displayStatusOnLCD(avgTemperature, avgHumidity);
  }

  delay(1);
}